Revit 2024 API
TransactWithCentralOptions.SetLockCallback Method
 Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetLockCallback(
	ICentralLockedCallback lockCallback
)
Visual Basic
Public Sub SetLockCallback ( _
	lockCallback As ICentralLockedCallback _
)
Visual C++
public:
void SetLockCallback(
	ICentralLockedCallback^ lockCallback
)
Parameters
lockCallback
Type: Autodesk.Revit.DB.ICentralLockedCallback
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TransactWithCentralOptions Class
Autodesk.Revit.DB Namespace